{"scoring":"There is only one subtask in this problem that's scored from 100.\r\n\r\n\\begin{itemize}\r\n\\item The total number of queries you ask can be up to 100 queries in each test.\r\n\\item The scoring of this subtask depends on the number of queries.\r\n\\item Let $q$ be the maximum number of queries you needed in a test in this subtask then if:\r\n\\begin{itemize}\r\n\\item $q \\le 7$ you get 100 points\r\n\\item $7 < q \\le 20$ you get $100 - 3*(q-7)$\r\n\\item $20 < q \\le 100$ you get $61 - \\frac{(q-20)}{2}$\r\n\\item $q > 100$ you get 0 points\r\n\\end{itemize}\r\n\\end{itemize}\r\n\r\n","notes":"In the first sample, the sequence of switches is $[0,3,2,4]$\r\n\r\nIn the second sample, the sequence of switches is $[0,1,2]$","legend":"\\textit{This is an interactive problem. You have to use a \\texttt{flush} operation right after printing each line. For example, in C++ you should use the function \\texttt{fflush(stdout)} and in Java --- \\texttt{System.out.flush()}}\r\n\r\nDr. Evil got himself a new secret hideout that has $n$ lamps and $m$ switches. The lamps are numbered from $0$ to $n-1$ and the switches are numbered from $0$ to $m-1$. Each lamp is connected to exactly one switch. No two lamps are connected to the same switch but there may be some switches not connected to any lamp.\r\n\r\nThe lighting system in the hideout is a bit strange. To light some lamps you need to turn on the switches that are connected to these lamps then press a button then the lamps connected to these switches will light. Note that you can also turn on some switches that aren't connected to any lamp and the result won't change.\r\n\r\nYou don't know which switch is connected to each lamp that's why you can make some experiments with the lighting system by turning on some switches and see which lamps will light. \r\n\r\nDr. Evil is very busy that's why he wants to know for each lamp the switch that's connected to it in a minimum number of queries, Can you help him?","authorLogin":"mahmoud_badawy","language":"english","timeLimit":5000,"output":"When your program guesses the switches for each lamp print a line containing ``\\texttt{-1}''. Then a line containing $n$ integers where the $i^{th}$ integer is the switch connected to the $i^{th}$ lamp. Don't forget then to flush your output.\r\n\r\nThen you need to read the system's response. If you guessed the switches correctly the system will respond with ``\\texttt{1}'' and with ``\\texttt{-1}'' otherwise.\r\n\r\nIf you guessed the switches correctly then read the $n$ for the next case if there's any and start interaction to solve the next case. otherwise terminate your program immediately.\r\n","inputFile":"stdin","outputFile":"stdout","input":"Use standard input to read the responses to the queries.\r\n\r\nFirst, you will get an integer $T \\le 500$ which is the number of cases you need to solve.\r\n\r\nThe first line of each test case will contain two integers which are $n$ and $m$. $(1 \\le n \\le m \\le 100)$\r\n\r\nIt's guaranteed that each lamp is connected to exactly one switch and no two lamps are connected to the same switch.","authorName":"Mahmoud Badawy","sampleTests":[{"output":"\r\n\r\n4\r\n0 2 3 4\r\n\r\n\r\n2\r\n0 2\r\n\r\n\r\n2\r\n3 4\r\n\r\n\r\n-1\r\n0 3 2 4\r\n\r\n\r\n2\r\n0 1\r\n\r\n\r\n-1\r\n0 1 2","input":"2\r\n4 5\r\n\r\n\r\n4\r\n0 1 2 3\r\n\r\n\r\n2\r\n0 2\r\n\r\n\r\n2\r\n1 3\r\n\r\n\r\n1\r\n3 3\r\n\r\n\r\n2\r\n0 1\r\n\r\n\r\n1","inputFile":"example.01","outputFile":"example.01.a"}],"name":"Secret Hideout","interaction":"When you want to ask a query you need to print a line containing $y$ where $0 \\le y \\le m$ is the number of switches you need to ask about.\r\n\r\nThen print a line containing $y$ distinct integers each is between $0$ and $m-1$ inclusive.\r\n\r\nIf you made a mistake the system will respond with a line containing ``\\texttt{-1}'', If you received this response you must terminate your program immediately.\r\n\r\nOtherwise, you will receive a line containing $x$ where  $0 \\le x \\le n$ is the number of lamps that lighted. Then a line containing $x$ distinct integers each is between $0$ and $n-1$ inclusive which are the numbers of the lamps that lighted.","memoryLimit":268435456,"tutorial":""}